Autodesk.Revit.DB.BasicFileInfo.Extract(System.String)
Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
file:
The full path to the file to be queried, including project (.rvt) and family (.rfa) files.
Returns:
If successful, basic file data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is a newer format file where the structure of the BasicFileInfo storage has changed, or the file is saved in very old version of Revit without basic file data.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.GetDocumentVersion
Gets the DocumentVersion for the file.
Returns:
The DocumentVersion for the file.
Since:
2015

Autodesk.Revit.DB.BasicFileInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BasicFileInfo.IsForeign
Checks if the file was saved by an application that was not developed or licensed by Autodesk.
Since:
2020

Autodesk.Revit.DB.BasicFileInfo.Author
Returns Author.
Since:
2019

Autodesk.Revit.DB.BasicFileInfo.ModelIdentity
GUID of current model
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.LatestCentralEpisodeGUID
This is the central model's episode GUID corresponding to the last reload latest
done for this model.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.LatestCentralVersion
This is the central model's version number corresponding to the last reload latest
done for this model.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.AllLocalChangesSavedToCentral
Are all local changes saved to the central file?
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.CentralPath
Returns the central model path.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.Username
Returns the username.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.LanguageWhenSaved
Return the language active for the last save
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.Format
The file format indicator (currently, the major release version such as "2019") used for saving the file.
Since:
2019

Autodesk.Revit.DB.BasicFileInfo.SavedInVersion
Returns the version in which file is saved.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsSavedInLaterVersion
Checks if the file is saved in a later version of Revit than the running Revit.
Remarks:
If the structure of the BasicFileInfo storage has not changed in a newer format file,
this will indicate that the file format is newer.
However, if the structure of the storage has changed in a newer format file,
extraction would have failed and this method cannot be used to make that determination.
Since:
2017

Autodesk.Revit.DB.BasicFileInfo.IsSavedInCurrentVersion
Checks if the file is saved in the current version.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsCreatedLocal
Checks if the file is local and created by RevitServerTool.exe.
Remarks:
The value will be set to false after the file is saved and IsLocal will become true.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsInProgress
Checks if the file is workshared and is in process of becoming Central.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsCentral
Checks if the file is workshared and Central.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsLocal
Checks if the file is workshared and Local.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo.IsWorkshared
Checks if the file is workshared.
Since:
2013

Autodesk.Revit.DB.BasicFileInfo
Encapsulates basic information about a Revit file, including worksharing status, Revit version, username and central path.
Remarks:
This class provides a fast access to get basic information without fully opening a Revit file. The
Extract method
can initialize a new instance of this class by providing a full path for Revit file, including project (.rvt) and family (.rfa) files.
This class can extract information from files of older formats.
If the structure of the BasicFileInfo storage has not changed,
it can also extract information from files of newer formats
(making the method IsSavedInLaterVersion relevant).
However, if the structure of the storage has changed in a newer file format,
Extract will not be able to extract the information.
Since:
2013